zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKE18F16/MKE18F16.h
/*
** ###################################################################
**     Processors:          MKE18F256VLH16
**                          MKE18F256VLL16
**                          MKE18F512VLH16
**                          MKE18F512VLL16
**
**     Compilers:           Keil ARM C/C++ Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**                          MCUXpresso Compiler
**
**     Reference manual:    KE1xFP100M168SF0RM, Rev. 2, Aug. 2016
**     Version:             rev. 4.0, 2016-09-20
**     Build:               b180802
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MKE18F16
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2018 NXP
**
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2015-11-18)
**         Initial version.
**     - rev. 2.0 (2015-12-03)
**         Alpha version based on rev0 RDP.
**     - rev. 3.0 (2016-04-13)
**         Final version based on rev1 RDP.
**     - rev. 4.0 (2016-09-20)
**         Updated based on rev2 RDP.
**
** ###################################################################
*/

/*!
 * @file MKE18F16.h
 * @version 4.0
 * @date 2016-09-20
 * @brief CMSIS Peripheral Access Layer for MKE18F16
 *
 * CMSIS Peripheral Access Layer for MKE18F16
 */

#ifndef _MKE18F16_H_
#define _MKE18F16_H_                             /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0400U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U

/**
 * @brief Macro to calculate address of an aliased word in the peripheral
 *        bitband area for a peripheral register and bit (bit band region 0x40000000 to
 *        0x400FFFFF).
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return  Address of the aliased word in the peripheral bitband area.
 */
#define BITBAND_REGADDR(Reg,Bit) (0x42000000u + (32u*((uint32_t)&(Reg) - (uint32_t)0x40000000u)) + (4u*((uint32_t)(Bit))))
/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access. Can
 *        be used for peripherals with 32bit access allowed.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG32(Reg,Bit) (*((uint32_t volatile*)(BITBAND_REGADDR((Reg),(Bit)))))
#define BITBAND_REG(Reg,Bit) (BITBAND_REG32((Reg),(Bit)))
/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access. Can
 *        be used for peripherals with 16bit access allowed.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG16(Reg,Bit) (*((uint16_t volatile*)(BITBAND_REGADDR((Reg),(Bit)))))
/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access. Can
 *        be used for peripherals with 8bit access allowed.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG8(Reg,Bit) (*((uint8_t volatile*)(BITBAND_REGADDR((Reg),(Bit)))))

/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 108                /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  HardFault_IRQn               = -13,              /**< Cortex-M4 SV Hard Fault Interrupt */
  MemoryManagement_IRQn        = -12,              /**< Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn                = -11,              /**< Cortex-M4 Bus Fault Interrupt */
  UsageFault_IRQn              = -10,              /**< Cortex-M4 Usage Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M4 SV Call Interrupt */
  DebugMonitor_IRQn            = -4,               /**< Cortex-M4 Debug Monitor Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M4 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M4 System Tick Interrupt */

  /* Device specific interrupts */
  DMA0_IRQn                    = 0,                /**< DMA channel 0 transfer complete */
  DMA1_IRQn                    = 1,                /**< DMA channel 1 transfer complete */
  DMA2_IRQn                    = 2,                /**< DMA channel 2 transfer complete */
  DMA3_IRQn                    = 3,                /**< DMA channel 3 transfer complete */
  DMA4_IRQn                    = 4,                /**< DMA channel 4 transfer complete */
  DMA5_IRQn                    = 5,                /**< DMA channel 5 transfer complete */
  DMA6_IRQn                    = 6,                /**< DMA channel 6 transfer complete */
  DMA7_IRQn                    = 7,                /**< DMA channel 7 transfer complete */
  DMA8_IRQn                    = 8,                /**< DMA channel 8 transfer complete */
  DMA9_IRQn                    = 9,                /**< DMA channel 9 transfer complete */
  DMA10_IRQn                   = 10,               /**< DMA channel 10 transfer complete */
  DMA11_IRQn                   = 11,               /**< DMA channel 11 transfer complete */
  DMA12_IRQn                   = 12,               /**< DMA channel 12 transfer complete */
  DMA13_IRQn                   = 13,               /**< DMA channel 13 transfer complete */
  DMA14_IRQn                   = 14,               /**< DMA channel 14 transfer complete */
  DMA15_IRQn                   = 15,               /**< DMA channel 15 transfer complete */
  DMA_Error_IRQn               = 16,               /**< DMA error interrupt channels 0-15 */
  MCM_IRQn                     = 17,               /**< FPU sources */
  FTFE_IRQn                    = 18,               /**< FTFE command complete */
  Read_Collision_IRQn          = 19,               /**< FTFE read collision */
  LVD_LVW_IRQn                 = 20,               /**< PMC controller low-voltage detect, low-voltage warning */
  Doublebit_Fault_IRQn         = 21,               /**< FTFE double bit fault detect */
  WDOG_EWM_IRQn                = 22,               /**< Single interrupt vector for WDOG and EWM */
  Reserved39_IRQn              = 23,               /**< Reserved interrupt */
  LPI2C0_IRQn                  = 24,               /**< Inter-integrated circuit 0 interrupt */
  LPI2C1_IRQn                  = 25,               /**< Inter-integrated circuit 1 interrupt */
  LPSPI0_IRQn                  = 26,               /**< Serial peripheral Interface 0 interrupt */
  LPSPI1_IRQn                  = 27,               /**< Serial peripheral Interface 1 interrupt */
  Reserved44_IRQn              = 28,               /**< Reserved interrupt */
  PWT_IRQn                     = 29,               /**< PWT interrupt */
  Reserved46_IRQn              = 30,               /**< Reserved interrupt */
  LPUART0_TX_IRQn              = 31,               /**< LPUART0 transmit interrupt */
  LPUART0_RX_IRQn              = 32,               /**< LPUART0 receive interrupt */
  LPUART1_TX_IRQn              = 33,               /**< LPUART1 transmit interrupt */
  LPUART1_RX_IRQn              = 34,               /**< LPUART1 receive interrupt */
  LPUART2_TX_IRQn              = 35,               /**< LPUART2 transmit interrupt */
  LPUART2_RX_IRQn              = 36,               /**< LPUART2 receive interrupt */
  Reserved53_IRQn              = 37,               /**< Reserved interrupt */
  Reserved54_IRQn              = 38,               /**< Reserved interrupt */
  ADC0_IRQn                    = 39,               /**< ADC conversion complete interrupt */
  CMP0_IRQn                    = 40,               /**< CMP0 interrupt */
  CMP1_IRQn                    = 41,               /**< CMP1 interrupt */
  FTM0_IRQn                    = 42,               /**< FTM0 single interrupt vector for all sources */
  FTM1_IRQn                    = 43,               /**< FTM1 single interrupt vector for all sources */
  FTM2_IRQn                    = 44,               /**< FTM2 single interrupt vector for all sources */
  Reserved61_IRQn              = 45,               /**< Reserved interrupt */
  RTC_IRQn                     = 46,               /**< RTC alarm interrupt */
  RTC_Seconds_IRQn             = 47,               /**< RTC seconds interrupt */
  LPIT0_Ch0_IRQn               = 48,               /**< LPIT channel 0 overflow interrupt */
  LPIT0_Ch1_IRQn               = 49,               /**< LPIT channel 1 overflow interrupt */
  LPIT0_Ch2_IRQn               = 50,               /**< LPIT channel 2 overflow interrupt */
  LPIT0_Ch3_IRQn               = 51,               /**< LPIT channel 3 overflow interrupt */
  PDB0_IRQn                    = 52,               /**< Programmable delay block 0 interrupt */
  Reserved69_IRQn              = 53,               /**< Reserved interrupt */
  Reserved70_IRQn              = 54,               /**< Reserved interrupt */
  Reserved71_IRQn              = 55,               /**< Reserved interrupt */
  DAC0_IRQn                    = 56,               /**< Digital-to-analog converter 0 interrupt */
  SCG_RCM_IRQn                 = 57,               /**< SCG_RCM interrupt */
  LPTMR0_IRQn                  = 58,               /**< Single interrupt vector for  Low Power Timer 0 interrupt */
  PORTA_IRQn                   = 59,               /**< Port A pin detect interrupt */
  PORTB_IRQn                   = 60,               /**< Port B pin detect interrupt */
  PORTC_IRQn                   = 61,               /**< Port C pin detect interrupt */
  PORTD_IRQn                   = 62,               /**< Port D pin detect interrupt */
  PORTE_IRQn                   = 63,               /**< Port E pin detect interrupt */
  SWI_IRQn                     = 64,               /**< Software interrupt */
  Reserved81_IRQn              = 65,               /**< Reserved interrupt */
  Reserved82_IRQn              = 66,               /**< Reserved interrupt */
  Reserved83_IRQn              = 67,               /**< Reserved interrupt */
  PDB1_IRQn                    = 68,               /**< Programmable delay block 1 interrupt */
  FLEXIO_IRQn                  = 69,               /**< FLEXIO interrupt */
  CMP2_IRQn                    = 70,               /**< CMP2 interrupt */
  FTM3_IRQn                    = 71,               /**< FlexTimer module 3 fault, overflow and channels interrupt */
  Reserved88_IRQn              = 72,               /**< Reserved interrupt */
  ADC1_IRQn                    = 73,               /**< ADC conversion complete interrupt */
  ADC2_IRQn                    = 74,               /**< ADC conversion complete interrupt */
  Reserved91_IRQn              = 75,               /**< Reserved interrupt */
  Reserved92_IRQn              = 76,               /**< Reserved interrupt */
  PDB2_IRQn                    = 77,               /**< Programmable delay block 2 interrupt */
  CAN0_ORed_IRQn               = 78,               /**< can */
  CAN0_Error_IRQn              = 79,               /**< can */
  CAN0_Wake_Up_IRQn            = 80,               /**< can */
  CAN0_ORed_Message_buffer_IRQn = 81,              /**< can */
  CAN0_Reserved1_IRQn          = 82,               /**< can */
  CAN0_Reserved2_IRQn          = 83,               /**< can */
  CAN0_Reserved3_IRQn          = 84,               /**< can */
  CAN1_ORed_IRQn               = 85,               /**< can */
  CAN1_Error_IRQn              = 86,               /**< can */
  CAN1_Wake_Up_IRQn            = 87,               /**< can */
  CAN1_ORed_Message_buffer_IRQn = 88,              /**< can */
  CAN1_Reserved1_IRQn          = 89,               /**< can */
  CAN1_Reserved2_IRQn          = 90,               /**< can */
  CAN1_Reserved3_IRQn          = 91                /**< can */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M4 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M4 Core Configuration
 * @{
 */

#define __MPU_PRESENT                  0         /**< Defines if an MPU is present or not */
#define __NVIC_PRIO_BITS               4         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */
#define __FPU_PRESENT                  1         /**< Defines if an FPU is present or not */

#include "core_cm4.h"                  /* Core Peripheral Access Layer */
#include "system_MKE18F16.h"           /* Device specific configuration file */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
/*!
 * @addtogroup edma_request
 * @{
 */

